from pyspark.sql import SparkSession
from pyspark.sql import functions as F

spark = SparkSession.builder.appName("myappname3Spark").getOrCreate()

try:
    data = [
    (1, "서울시", "은평구 불광동", 4512),
    (2, "경기도", "의정부시 의정부동", 3210),
    (3, "전라도", "광주시 양림동", 1420),
    (4, "서울시", "종로구 혜화동", 2150),
    (5, "서울시", "중랑구 면목동", 5630),
    (6, "경기도", "파주시 문산읍", 3840),
    (7, "전라도", "군산시 조촌동", 2180),
    (8, "서울시", "용산구 한남동", 1890),
    (9, "전라도", "완주군 삼례읍", 1240),
    (10, "서울시", "금천구 독산동", 4120),
    (11, "전라도", "순천시 조례동", 3450),
    (12, "경기도", "가평군 가평읍", 980),
    (13, "경기도", "화성시 향남읍", 6120),
    (14, "서울시", "동작구 사당동", 4890),
    (15, "경기도", "광명시 철산동", 3760),
    (16, "경기도", "시흥시 정왕동", 5430),
    (17, "경기도", "양주시 백석읍", 1650),
    (18, "경기도", "연천군 전곡읍", 1120),
    (19, "전라도", "신안군 압해읍", 750),
    (20, "경기도", "오산시 원동", 2980),
    (21, "경기도", "의왕시 오전동", 3110),
    (22, "서울시", "서대문구 남가좌동", 4320),
    (23, "서울시", "노원구 상계동", 6870),
    (24, "경기도", "안성시 공도읍", 4230),
    (25, "전라도", "전주시 효자동", 5120),
    (26, "전라도", "목포시 용당동", 2340),
    (27, "전라도", "여수시 학동", 3110),
    (28, "경기도", "포천시 소흘읍", 2890),
    (29, "경기도", "양평군 양평읍", 1450),
    (30, "전라도", "익산시 영등동", 3980)
]
    df = spark.createDataFrame(data,["ID","시/도","행정구역","인구수"])

    result_df = df.groupBy("시/도").agg(F.count("행정구역").alias("조사한지역들"),
                                      F.sum("인구수").alias("총합 인구수"))
    result_df.show()
finally:
    spark.stop()